{
  "events": [
    {
      "id": 1,
      "title": "Research Symposium",
      "description": "An academic conference for presenting research papers across departments.",
      "longdescription": "This symposium brings together researchers, academicians, and students to present and discuss their latest research findings across multiple departments. Attendees can participate in paper presentations, panel discussions, and networking sessions, promoting academic collaboration, innovation, and professional development.",
      "date": "2022-10-18",
      "time": "10:00 AM - 04:00 PM",
      "venue": "Seminar Hall",
      "department": "Computer Science",
      "type": "academic",
      "organizer": "Academic Committee",
      "contact": "academic@college.edu",
      "image": "/researchsymposium.jpg"
    },
    {
      "id": 2,
      "title": "Mathematics Workshop",
      "description": "Hands-on sessions on advanced mathematical concepts and problem solving.",
      "longdescription": "The Mathematics Workshop provides participants with in-depth exposure to advanced mathematical concepts through interactive problem-solving sessions. Participants explore algebra, calculus, probability, and applied mathematics while enhancing critical thinking and analytical skills. The workshop fosters collaboration, peer learning, and practical application of theoretical knowledge.",
      "date": "2023-11-02",
      "time": "09:00 AM - 03:00 PM",
      "venue": "Math Department Lab",
      "department": "Mathematics",
      "type": "academic",
      "organizer": "Math Club",
      "contact": "mathclub@college.edu",
      "image": "/MathematicsWorkshop.jpg"
    },
    {
      "id": 3,
      "title": "Science Fair",
      "description": "Exhibition of innovative scientific projects by students across all departments.",
      "longdescription": "The Science Fair showcases creative scientific projects and experiments developed by students from all departments. Participants demonstrate their understanding of scientific principles and problem-solving abilities. The event includes interactive demonstrations, discussions with experts, and opportunities to gain feedback, fostering curiosity, innovation, and collaborative scientific exploration.",
      "date": "2024-11-15",
      "time": "10:00 AM - 05:00 PM",
      "venue": "Science Block",
      "department": "Physics",
      "type": "academic",
      "organizer": "Science Committee",
      "contact": "science@college.edu",
      "image": "/ScienceFair.jpg"
    },
    {
      "id": 5,
      "title": "Annual Tech Fest",
      "description": "A grand technical festival featuring coding competitions, robotics challenges, and tech talks from industry experts.",
      "longdescription": "The Annual Tech Fest is a comprehensive technical festival designed to engage students in coding, robotics, and technology innovation. Attendees participate in competitions, workshops, and interactive sessions led by industry experts. The festival encourages problem-solving, creativity, and practical application of technical knowledge, while providing a platform for networking and professional development in technology fields.",
      "date": "2022-10-15",
      "time": "09:00 AM - 06:00 PM",
      "venue": "Main Auditorium",
      "department": "Computer Science",
      "type": "technical",
      "organizer": "Tech Club",
      "contact": "techclub@college.edu",
      "image": "/technologyfestival.jpg"
    },
    {
      "id": 6,
      "title": "Workshop on AI ",
      "description": "An intensive workshop covering fundamentals and advanced concepts of Artificial Intelligence and Machine Learning.",
      "longdescription": "The Workshop on AI provides a detailed understanding of artificial intelligence and machine learning principles. Participants engage in hands-on exercises, algorithm development, and data analysis projects. The workshop promotes practical skills, innovation, and critical thinking, preparing students for real-world applications and careers in AI, robotics, and data science.",
      "date": "2023-10-25",
      "time": "10:00 AM - 04:00 PM",
      "venue": "Seminar Hall",
      "department": "Computer Science",
      "type": "technical",
      "organizer": "AI Research Group",
      "contact": "ai-research@college.edu",
      "image": "/WorkshopAI.jpg"
    },
    {
      "id": 7,
      "title": "Hackathon 2023",
      "description": "24-hour coding hackathon for solving real-world problems with innovative solutions.",
      "longdescription": "Hackathon 2023 challenges participants to solve real-world problems through innovative coding solutions within a 24-hour timeframe. Teams collaborate intensively, applying software development, algorithm design, and problem-solving skills. The event promotes creativity, technical expertise, teamwork, and networking, fostering a competitive yet collaborative environment for aspiring programmers and developers.",
      "date": "2024-11-10",
      "time": "09:00 AM - 09:00 AM",
      "venue": "Innovation Lab",
      "department": "Computer Science",
      "type": "technical",
      "organizer": "Coding Club",
      "contact": "codingclub@college.edu",
      "image": "/Hackathon2023.jpg"
    },
    {
      "id": 9,
      "title": "Cultural Night",
      "description": "An evening filled with music, dance, and theatrical performances.",
      "longdescription": "Cultural Night is an immersive event showcasing music, dance, and theater performances by students. It celebrates diversity, creativity, and artistic expression, while fostering a sense of community. Attendees enjoy live performances, cultural exhibitions, and interactive experiences, promoting appreciation of the arts and teamwork among participants.",
      "date": "2023-11-05",
      "time": "05:00 PM - 10:00 PM",
      "venue": "Open Air Theatre",
      "department": "Fine Arts",
      "type": "cultural",
      "organizer": "Cultural Committee",
      "contact": "cultural@college.edu",
      "image": "/CulturalNight.jpg"
    },
    {
      "id": 10,
      "title": "Art Exhibition",
      "description": "An exhibition showcasing creative artwork and paintings by Fine Arts students.",
      "longdescription": "The Art Exhibition highlights the creativity and talent of Fine Arts students. Visitors can explore paintings, sculptures, and mixed media works while interacting with artists. The event encourages artistic expression, critical appreciation, and engagement with contemporary art trends, providing an educational and inspirational experience for all attendees.",
      "date": "2024-11-12",
      "time": "10:00 AM - 06:00 PM",
      "venue": "Fine Arts Block",
      "department": "Fine Arts",
      "type": "cultural",
      "organizer": "Art Club",
      "contact": "artclub@college.edu",
      "image": "/ArtExhibition.jpg"
    },
    {
      "id": 11,
      "title": "Photography Contest",
      "description": "A competition capturing the beauty of campus life and creative themes.",
      "longdescription": "The Photography Contest encourages students to capture creative and meaningful images representing campus life and various themes. Participants showcase technical skills, artistic vision, and storytelling through photography. Judges provide feedback and recognition, promoting learning, creativity, and appreciation of visual arts.",
      "date": "2025-11-18",
      "time": "02:00 PM - 06:00 PM",
      "venue": "Auditorium Lobby",
      "department": "Fine Arts",
      "type": "cultural",
      "organizer": "Photography Club",
      "contact": "photo@college.edu",
      "image": "/PhotographyContest.jpg"
    },
    {
      "id": 13,
      "title": "Annual Sports Meet",
      "description": "Competitions in cricket, football, basketball, and athletics.",
      "longdescription": "The Annual Sports Meet hosts a variety of sports competitions including cricket, football, basketball, and athletics. Students participate in friendly and competitive matches, promoting teamwork, physical fitness, and sportsmanship. The event provides opportunities for student engagement, leadership, and celebration of athletic achievement.",
      "date": "2023-12-01",
      "time": "08:00 AM - 05:00 PM",
      "venue": "College Sports Ground",
      "department": "Physical Education",
      "type": "sports",
      "organizer": "Sports Committee",
      "contact": "sports@college.edu",
      "image": "/AnnualSportsMeet.jpg"
    },
    {
      "id": 14,
      "title": "Cricket Tournament",
      "description": "Inter-department cricket matches with trophy and prizes.",
      "longdescription": "The Cricket Tournament features competitive inter-department cricket matches, allowing students to showcase their athletic abilities, teamwork, and sportsmanship. Participants compete for trophies and recognition while promoting camaraderie and healthy competition among departments.",
      "date": "2024-12-05",
      "time": "09:00 AM - 05:00 PM",
      "venue": "Cricket Ground",
      "department": "Physical Education",
      "type": "sports",
      "organizer": "Cricket Club",
      "contact": "cricket@college.edu",
      "image": "/CricketTournament.jpg"
    },
    {
      "id": 15,
      "title": "Football Championship",
      "description": "Annual football tournament with multiple college teams.",
      "longdescription": "The Football Championship brings together multiple college teams for a competitive tournament. Students demonstrate skill, strategy, and team coordination. The event emphasizes athletic development, sportsmanship, and school spirit, while providing an engaging spectator experience for the campus community.",
      "date": "2025-12-10",
      "time": "09:00 AM - 06:00 PM",
      "venue": "Football Field",
      "department": "Physical Education",
      "type": "sports",
      "organizer": "Football Club",
      "contact": "football@college.edu",
      "image": "/FootballChampionship.jpg"
    },
    {
      "id": 16,
      "title": "Business Strategy Summit",
      "description": "A case competition testing strategic problem-solving skills.",
      "longdescription": "The Business Strategy Summit invites students to compete in solving real-world business cases. Teams present innovative strategies to panels of industry experts, gaining exposure, confidence, and practical knowledge.",
      "date": "2022",
      "time": "10:00 AM - 03:00 PM",
      "venue": "Main Auditorium",
      "department": "Business Administration",
      "type": "competition",
      "organizer": "Strategy Club",
      "contact": "strategy@college.edu",
      "image": "/BusinessStrategySummit.jpg"
    },
    {
      "id": 17,
      "title": "Entrepreneurship Fair",
      "description": "Students showcase their startup ideas and prototypes.",
      "longdescription": "The Entrepreneurship Fair provides a platform for aspiring student entrepreneurs to pitch ideas, display prototypes, and network with investors and mentors. The event fosters creativity, innovation, and collaboration across the business community.",
      "date": "2023",
      "time": "09:30 AM - 04:30 PM",
      "venue": "Exhibition Hall",
      "department": "Business Administration",
      "type": "fair",
      "organizer": "Entrepreneurship Society",
      "contact": "entrepreneurship@college.edu",
      "image": "/EntrepreneurshipFair.jpg"
    },
    {
      "id": 18,
      "title": "Marketing Mania",
      "description": "A creative contest in advertising and brand strategy.",
      "longdescription": "Marketing Mania challenges students to design impactful campaigns, advertisements, and branding strategies. Teams showcase creativity while applying marketing theories in a real-world inspired contest judged by professionals.",
      "date": "2024",
      "time": "11:00 AM - 05:00 PM",
      "venue": "Conference Room B",
      "department": "Business Administration",
      "type": "competition",
      "organizer": "Marketing Club",
      "contact": "marketing@college.edu",
      "image": "/MarketingMania.jpg"
    }
  ]
}
